#+title: Doom configs
#+options: prop:t
#+startup: fold
#+include: ./secrets.org
#+include: ./config.org

***** Agenda
#+begin_src emacs-lisp
(require 'org-agenda) ;; Faster loading
(require 'org-super-agenda)
#+end_src

#+begin_src emacs-lisp
(setq org-agenda-start-with-log-mode t)
(setq org-log-done 'time)
(setq org-log-into-drawer t)
(setq org-cycle-emulate-tab nil)
(setq org-startup-folded 'content)


(defun org-agenda-open-hook ()
   " Open agenda in writeroom mode "
   (writeroom-mode))

(add-hook 'org-agenda-mode-hook 'org-agenda-open-hook)

;;; Custom span
(setq org-agenda-span 1
      org-agenda-start-day "+0d"
      org-agenda-skip-timestamp-if-done t
      org-agenda-skip-deadline-if-done t
      org-agenda-skip-scheduled-if-done t
      org-agenda-skip-scheduled-if-deadline-is-shown t
      org-agenda-skip-timestamp-if-deadline-is-shown t)

;; Custom styles for dates in agenda
;;(custom-set-faces!
;;  '(org-agenda-date :inherit outline-1 :height 0.7)
;;  '(org-agenda-date-today :inherit diary :height 0.7)
;;  '(org-agenda-date-weekend :ineherit outline-2 :height  0.7)
;;  '(org-agenda-date-weekend-today :inherit outline-4 :height 0.7)
;;  '(org-super-agenda-header :inherit custom-button :weight bold :height 1))


;; Toggle completed entries function
(defun org-agenda-toggle-completed ()
  (interactive)
  (setq org-agenda-skip-timestamp-if-done (not org-agenda-skip-timestamp-if-done)
        org-agenda-skip-deadline-if-done (not org-agenda-skip-timestamp-if-done)
        org-agenda-skip-scheduled-if-done (not org-agenda-skip-timestamp-if-done))
  (org-agenda-redo))

(map!
  :map evil-org-agenda-mode-map
  :after org-agenda
  :nvmeg "s d" #'org-agenda-toggle-completed)


;;; Priority
(setq
 org-fancy-priorities-list '("[H]"
                             "[M]"
                             "[L]")
 org-agenda-block-separator 8411)

(setq org-agenda-custom-commands
      '(("v" "A better agenda view"
         ((tags "PRIORITY=\"A\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done 'scheduled))
                 (org-agenda-overriding-header "High-priority:")))
          (tags "PRIORITY=\"B\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done 'scheduled))
                 (org-agenda-overriding-header "Medium-priority:")))
          (tags "PRIORITY=\"C\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done 'scheduled))
                 (org-agenda-overriding-header "Low-priority:")))
          (tags "customtag"
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Tasks marked with customtag:")))
          (agenda ""
                  ((org-agenda-overriding-header "")
                   (org-super-agenda-groups
                    '(
                        (:name ""
                         :scheduled past
                         :order 2
                         :face 'error)
                        (:habit t)
                        (:name " Today"
                         :time-grid t
                         :todo "TODO"
                         :scheduled today
                         :order 0)))))

          (alltodo "" (
                       (org-agenda-overriding-header ""
                         (org-super-agenda-groups
                          '((:log t)
                            (:name " Important"
                             :tag "critical"
                             :priority "A")
                            (:name " Personal"
                             :and(:file-path "agenda/personal/" :not (:tag "event"))
                             :order 3)
                            (:name " Project"
                             :and(:file-path "agenda/project/" :not (:tag "event"))
                             :order 3)
                            (:name " Study"
                             :and(:file-path "agenda/study/" :not (:tag "event"))
                             :order 3)
                            (:name " Work"
                             :and(:file-path "agenda/work/" :not (:tag "event"))
                             :order 3))))))))))


;; Ricing org agenda
(setq org-agenda-current-time-string "")
(setq org-agenda-time-grid '((daily) () "" ""))

(setq org-agenda-prefix-format '(
                                 (agenda . "  %?-2i %t ")
                                 (todo . " %i %-12:c")
                                 (tags . " %i %-12:c")
                                 (search . " %i %-12:c")))

(setq org-agenda-hide-tags-regexp ".*")

(setq org-agenda-category-icon-alist
      `(("Work" ,(list (all-the-icons-faicon "coffee" :height 0.8)) nil nil :ascent center)
        ("Project" ,(list (all-the-icons-faicon "home" :v-adjust 0.005)) nil nil :ascent center)
        ("Study" ,(list (all-the-icons-faicon "pencil" :v-adjust 0.9)) nil nil :ascent center)
        ("Personal" ,(list (all-the-icons-material "person" :height 0.9)) nil nil :ascent center)))

#+end_src

#+RESULTS:
| Work     | () | nil | nil | :ascent | center |
| Project  | () | nil | nil | :ascent | center |
| Study    | () | nil | nil | :ascent | center |
| Personal | () | nil | nil | :ascent | center |

